wipermail/amperka-boards/boards.txt
menu.version=Version

iskra-nano-pb.name=Amperka Iskra Nano PB
iskra-nano-pb.upload.tool=avrdudecustom
iskra-nano-pb.upload.protocol=arduino
iskra-nano-pb.upload.mcu=atmega328pb
iskra-nano-pb.upload.maximum_size=32256
iskra-nano-pb.upload.maximum_data_size=2048

iskra-nano-pb.bootloader.tool=avrdudecustom
iskra-nano-pb.bootloader.low_fuses=0xFF
iskra-nano-pb.bootloader.high_fuses=0xDE
iskra-nano-pb.bootloader.unlock_bits=0xFF
iskra-nano-pb.bootloader.lock_bits=0xCF

iskra-nano-pb.build.mcu=atmega328p
iskra-nano-pb.build.board=AVR_A_STAR_328PB
iskra-nano-pb.build.extra_flags=-include "{runtime.platform.path}/variants/iskra-nano-pb/io_328pb.h"
iskra-nano-pb.build.core=arduino:arduino
iskra-nano-pb.build.variant=iskra-nano-pb

iskra-nano-pb.upload.speed=115200
iskra-nano-pb.bootloader.extended_fuses=0xF4
iskra-nano-pb.bootloader.file=optiboot/optiboot_atmega328pb_16mhz.hex
iskra-nano-pb.build.f_cpu=16000000L
